package com.github.liao47.union.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 银联响应码枚举
 * @author liao47
 * @date 2021/2/26 16:45
 */
@AllArgsConstructor
@Getter
public enum UnionRespCodeEnum {
    /**
     * 成功
     */
    CODE_00("00", "成功"),
    /**
     * 有缺陷的成功
     */
    CODE_A6("A6", "有缺陷的成功"),
    /**
     * 交易失败。详情请咨询95516
     */
    CODE_01("01", "交易失败。详情请咨询95516"),
    /**
     * 系统未开放或暂时关闭，请稍后再试
     */
    CODE_02("02", "系统未开放或暂时关闭，请稍后再试"),
    /**
     * 交易通讯超时，请发起查询交易
     */
    CODE_03("03", "交易通讯超时，请发起查询交易"),
    /**
     * 交易已受理，请稍后查询交易结果
     */
    CODE_05("05", "交易已受理，请稍后查询交易结果"),
    /**
     * 系统繁忙，请稍后再试  
     */
    CODE_06("06", "系统繁忙，请稍后再试"),
    /**
     * 报文格式错误
     */
    CODE_10("10", "报文格式错误"),
    /**
     * 验证签名失败
     */
    CODE_11("11", "验证签名失败"),
    /**
     * 重复交易
     */
    CODE_12("12", "重复交易"),
    /**
     * 报文交易要素缺失
     */
    CODE_13("13", "报文交易要素缺失"),
    /**
     * 批量文件格式错误
     */
    CODE_14("14", "批量文件格式错误"),
    /**
     * 报文交易要素不支持
     */
    CODE_15("15", "报文交易要素不支持"),
    /**
     * 交易未通过，请尝试使用其他银联卡支付或联系95516
     */
    CODE_30("30", "交易未通过，请尝试使用其他银联卡支付或联系95516"),
    /**
     * 商户状态不正确
     */
    CODE_31("31", "商户状态不正确"),
    /**
     * 无此交易权限
     */
    CODE_32("32", "无此交易权限"),
    /**
     * 交易金额超限
     */
    CODE_33("33", "交易金额超限"),
    /**
     * 查无此交易
     */
    CODE_34("34", "查无此交易"),
    /**
     * 原交易不存在或状态不正确
     */
    CODE_35("35", "原交易不存在或状态不正确"),
    /**
     * 与原交易信息不符
     */
    CODE_36("36", "与原交易信息不符"),
    /**
     * 已超过最大查询次数或操作过于频繁
     */
    CODE_37("37", "已超过最大查询次数或操作过于频繁"),
    /**
     * 银联风险受限
     */
    CODE_38("38", "银联风险受限"),
    /**
     * 交易不在受理时间范围内
     */
    CODE_39("39", "交易不在受理时间范围内"),
    /**
     * 绑定关系检查失败
     */
    CODE_40("40", "绑定关系检查失败"),
    /**
     * 批量状态不正确，无法下载
     */
    CODE_41("41", "批量状态不正确，无法下载"),
    /**
     * 扣款成功但交易超过规定支付时间
     */
    CODE_42("42", "扣款成功但交易超过规定支付时间"),
    /**
     * 无此业务权限，详情请咨询95516
     */
    CODE_43("43", "无此业务权限，详情请咨询95516"),
    /**
     * 输入号码错误或暂未开通此项业务，详情请咨询95516
     */
    CODE_44("44", "输入号码错误或暂未开通此项业务，详情请咨询95516"),
    /**
     * 原交易已被成功退货或已被成功撤销
     */
    CODE_45("45", "原交易已被成功退货或已被成功撤销"),
    /**
     * 交易已被成功冲正
     */
    CODE_46("46", "交易已被成功冲正"),
    /**
     * 发卡机构Ⅱ、Ⅲ类户日累计或年累计交易限额超限
     */
    CODE_47("47", "发卡机构Ⅱ、Ⅲ类户日累计或年累计交易限额超限"),
    /**
     * 发卡机构Ⅲ类户账户余额超限
     */
    CODE_48("48", "发卡机构Ⅲ类户账户余额超限"),
    /**
     * 交易失败，详情请咨询您的发卡行
     */
    CODE_60("60", "交易失败，详情请咨询您的发卡行"),
    /**
     * 输入的卡号无效，请确认后输入
     */
    CODE_61("61", "输入的卡号无效，请确认后输入"),
    /**
     * 交易失败，发卡银行不支持该商户，请更换其他银行卡
     */
    CODE_62("62", "交易失败，发卡银行不支持该商户，请更换其他银行卡"),
    /**
     * 卡状态不正确
     */
    CODE_63("63", "卡状态不正确"),
    /**
     * 卡上的余额不足
     */
    CODE_64("64", "卡上的余额不足"),
    /**
     * 输入的密码、有效期或CVN2有误，交易失败
     */
    CODE_65("65", "输入的密码、有效期或CVN2有误，交易失败"),
    /**
     * 持卡人身份信息或手机号输入不正确，验证失败
     */
    CODE_66("66", "持卡人身份信息或手机号输入不正确，验证失败"),
    /**
     * 密码输入次数超限
     */
    CODE_67("67", "密码输入次数超限"),
    /**
     * 您的银行卡暂不支持该业务，请向您的银行或95516咨询
     */
    CODE_68("68", "您的银行卡暂不支持该业务，请向您的银行或95516咨询"),
    /**
     * 您的输入超时，交易失败
     */
    CODE_69("69", "您的输入超时，交易失败"),
    /**
     * 交易已跳转，等待持卡人输入
     */
    CODE_70("70", "交易已跳转，等待持卡人输入"),
    /**
     * 动态口令或短信验证码校验失败
     */
    CODE_71("71", "动态口令或短信验证码校验失败"),
    /**
     * 您尚未在{}银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通或拨打{}
     */
    CODE_72("72", "您尚未在{}银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通或拨打{}"),
    /**
     * 支付卡已超过有效期
     */
    CODE_73("73", "支付卡已超过有效期"),
    /**
     * 扣款成功，销账未知
     */
    CODE_74("74", "扣款成功，销账未知"),
    /**
     * 扣款成功，销账失败
     */
    CODE_75("75", "扣款成功，销账失败"),
    /**
     * 需要验密开通
     */
    CODE_76("76", "需要验密开通"),
    /**
     * 银行卡未开通认证支付
     */
    CODE_77("77", "银行卡未开通认证支付"),
    /**
     * 发卡行交易权限受限，详情请咨询您的发卡行
     */
    CODE_78("78", "发卡行交易权限受限，详情请咨询您的发卡行"),
    /**
     * 此卡可用，但发卡行暂不支持短信验证
     */
    CODE_79("79", "此卡可用，但发卡行暂不支持短信验证"),
    /**
     * 交易失败，Token 已过期
     */
    CODE_80("80", "交易失败，Token 已过期"),
    /**
     * 月累计交易笔数(金额)超限
     */
    CODE_81("81", "月累计交易笔数(金额)超限"),
    /**
     * 需要校验密码  
     */
    CODE_82("82", "需要校验密码"),
    /**
     * 发卡行（渠道）处理中
     */
    CODE_83("83", "发卡行（渠道）处理中"),
    /**
     * 交易失败，营销规则不满足
     */
    CODE_85("85", "交易失败，营销规则不满足"),
    /**
     * 二维码状态错误
     */
    CODE_86("86", "二维码状态错误"),
    /**
     * 支付次数超限
     */
    CODE_87("87", "支付次数超限"),
    /**
     * 无此二维码
     */
    CODE_88("88", "无此二维码"),
    /**
     * 无此Token、TR状态无效或者Token状态无效
     */
    CODE_89("89", "无此Token、TR状态无效或者Token状态无效"),
    /**
     * 账户余额不足
     */
    CODE_90("90", "账户余额不足"),
    /**
     * 认证失败
     */
    CODE_91("91", "认证失败"),
    /**
     * 营业执照过期
     */
    CODE_92("92", "营业执照过期"),
    /**
     * 营业执照吊销
     */
    CODE_93("93", "营业执照吊销"),
    /**
     * 营业执照注销
     */
    CODE_94("94", "营业执照注销"),
    /**
     * 营业执照迁出
     */
    CODE_95("95", "营业执照迁出"),
    /**
     * 营业执照撤销
     */
    CODE_96("96", "营业执照撤销"),
    /**
     * 文件不存在
     */
    CODE_98("98", "文件不存在"),
    /**
     * 通用错误
     */
    CODE_99("99", "通用错误");

    /**
     * 响应码
     */
    private final String code;
    /**
     * 响应描述
     */
    private final String msg;

    /**
     * 通过响应码获取枚举
     * @param code
     * @return
     */
    public static UnionRespCodeEnum getEnumByCode(String code) {
        for (UnionRespCodeEnum value : UnionRespCodeEnum.values()) {
            if (value.code.equals(code)) {
                return value;
            }
        }
        return null;
    }
}
